# GetPath Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ContinuousRail..::..GetPath Method
ContinuousRail Class See Also
---
Retrieves the rail path.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public IList<Curve> GetPath()
```

Visual Basic
---
```text
Public Function GetPath As IList(Of Curve)
```

Visual C++
---
```text
public:
IList<Curve^>^ GetPath()
```

# ### Return Value
The path of the rail.
# See Also
ContinuousRail Class
Autodesk.Revit.DB.Architecture Namespace